In [3]:
import psycopg2 as pg2
#python-postgre interface
import pandas as pd
#dataframes and series
import re
#regex
import logins
#local db connection
conn = pg2.connect(database='dvd_rentals', user=logins.login, password=logins.master_pass)
#connect to databases
cur = conn.cursor()

In [4]:
#create pandas dataframe filmdf from film table
cur.execute("SELECT * FROM film")
filmdata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film' ORDER BY ORDINAL_POSITION")
filmcolumns = list()
for i in cur.fetchall():
    filmcolumns.append(i[0])
filmdf = pd.DataFrame(data=filmdata, columns=filmcolumns)
filmdf = filmdf.drop(columns='last_update')
filmdf

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...
1,384,Grosse Wonderful,A Epic Drama of a Cat And a Explorer who must ...,2006,1,5,4.99,49,19.99,R,[Behind the Scenes],'australia':18 'cat':8 'drama':5 'epic':4 'exp...
2,8,Airport Pollock,A Epic Tale of a Moose And a Girl who must Con...,2006,1,6,4.99,54,15.99,R,[Trailers],'airport':1 'ancient':18 'confront':14 'epic':...
3,98,Bright Encounters,A Fateful Yarn of a Lumberjack And a Feminist ...,2006,1,4,4.99,73,12.99,PG-13,[Trailers],'boat':20 'bright':1 'conquer':14 'encount':2 ...
4,1,Academy Dinosaur,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"[Deleted Scenes, Behind the Scenes]",'academi':1 'battl':15 'canadian':20 'dinosaur...
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Young Language,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,G,"[Trailers, Behind the Scenes]",'administr':12 'boat':8 'boy':17 'databas':11 ...
996,997,Youth Kick,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,NC-17,"[Trailers, Behind the Scenes]",'boat':22 'cat':11 'challeng':14 'drama':5 'ki...
997,998,Zhivago Core,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,NC-17,[Deleted Scenes],'boy':16 'canadian':19 'compos':8 'core':2 'fa...
998,999,Zoolander Fiction,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,R,"[Trailers, Deleted Scenes]",'ancient':19 'boat':11 'china':20 'discov':14 ...
999,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,"[Trailers, Commentaries, Behind the Scenes]","'ark':2 'boy':12,17 'intrepid':4 'mad':8 'mona..."

In [5]:
cur.execute("SELECT * FROM actor")
actordata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'actor' ORDER BY ORDINAL_POSITION")
actorcolumns = list()
for i in cur.fetchall():
    actorcolumns.append(i[0])
actordf = pd.DataFrame(data=actordata, columns=actorcolumns)
actordf = actordf.drop(columns='last_update')
#df from actor table

In [6]:
cur.execute("SELECT * FROM film_actor")
film_actordata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film_actor' ORDER BY ORDINAL_POSITION")
film_actorcolumns = list()
for i in cur.fetchall():
    film_actorcolumns.append(i[0])
film_actordf = pd.DataFrame(data=film_actordata, columns=film_actorcolumns)
film_actordf = film_actordf.drop(columns='last_update')
#df from film_actor table

In [7]:
cur.execute("SELECT * FROM rental")
rentaldata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'rental' ORDER BY ORDINAL_POSITION")
rentalcolumns = list()
for i in cur.fetchall():
    rentalcolumns.append(i[0])
rentaldf = pd.DataFrame(data=rentaldata, columns=rentalcolumns)
rentaldf = rentaldf.drop(columns='last_update')
#df from rental table

In [8]:
cur.execute("SELECT * FROM payment")
paymentdata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'payment' ORDER BY ORDINAL_POSITION")
paymentcolumns = list()
for i in cur.fetchall():
    paymentcolumns.append(i[0])
paymentdf = pd.DataFrame(data=paymentdata, columns=paymentcolumns)
paymentdf = paymentdf.drop(columns='payment_date')
paymentdf
#df from payment table

       payment_id  customer_id  staff_id  rental_id amount
0           17503          341         2       1520   7.99
1           17504          341         1       1778   1.99
2           17505          341         1       1849   7.99
3           17506          341         2       2829   2.99
4           17507          341         2       3130   7.99
...           ...          ...       ...        ...    ...
14591       32094          245         2      12682   2.99
14592       32095          251         1      14107   0.99
14593       32096          252         2      13756   4.99
14594       32097          263         1      15293   0.99
14595       32098          264         2      14243   2.99

[14596 rows x 5 columns]

In [9]:
cur.execute("SELECT * FROM inventory")
inventorydata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'inventory' ORDER BY ORDINAL_POSITION")
inventorycolumns = list()
for i in cur.fetchall():
    inventorycolumns.append(i[0])
inventorydf = pd.DataFrame(data=inventorydata, columns=inventorycolumns)
inventorydf = inventorydf.drop(columns='last_update')
inventorydf
#df from inventory table

      inventory_id  film_id  store_id
0                1        1         1
1                2        1         1
2                3        1         1
3                4        1         1
4                5        1         2
...            ...      ...       ...
4576          4577     1000         1
4577          4578     1000         2
4578          4579     1000         2
4579          4580     1000         2
4580          4581     1000         2

[4581 rows x 3 columns]

In [10]:
cur.execute("SELECT * FROM film_category")
film_categorydata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'film_category' ORDER BY ORDINAL_POSITION")
film_categorycolumns = list()
for i in cur.fetchall():
    film_categorycolumns.append(i[0])
film_categorydf = pd.DataFrame(data=film_categorydata, columns=film_categorycolumns)
film_categorydf = film_categorydf.drop(columns='last_update')
#df from film_category table

In [11]:
cur.execute("SELECT * FROM category")
categorydata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'category' ORDER BY ORDINAL_POSITION")
categorycolumns = list()
for i in cur.fetchall():
    categorycolumns.append(i[0])
categorydf = pd.DataFrame(data=categorydata, columns=categorycolumns)
categorydf = categorydf.drop(columns='last_update')
#df from category table

In [12]:
cur.execute("SELECT * FROM staff")
staffdata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'staff' ORDER BY ORDINAL_POSITION")
staffcolumns = list()
for i in cur.fetchall():
    staffcolumns.append(i[0])
staffdf = pd.DataFrame(data=staffdata, columns=staffcolumns)
staffdf = staffdf.drop(columns='last_update')
#df from staff table

In [13]:
cur.execute("SELECT * FROM store")
storedata = cur.fetchall()
cur.execute("SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = 'store' ORDER BY ORDINAL_POSITION")
storecolumns = list()
for i in cur.fetchall():
    storecolumns.append(i[0])
storedf = pd.DataFrame(data=storedata, columns=storecolumns)
storedf = storedf.drop(columns=['last_update','address_id'])
#df from store table

In [14]:
#1 master
#merging several dataframes into master1 dataframe 
df1 = pd.merge(filmdf, film_actordf, how='left', on='film_id')
df2 = pd.merge(df1, actordf, how='left', on='actor_id')
df3 = pd.merge(df2, inventorydf, how='left', on='film_id')
#dropping duplicate columns
rentaldf = rentaldf.drop(columns='customer_id')
df4 = pd.merge(df3, rentaldf, how='left', on='inventory_id')
paymentdf = paymentdf.drop(columns='staff_id')
m1 = pd.merge(df4, paymentdf, how='left', on='rental_id')
paymentdf = pd.DataFrame(data=paymentdata, columns=paymentcolumns)
paymentdf = paymentdf.drop(columns='payment_date')
m1

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,last_name,inventory_id,store_id,rental_id,rental_date,return_date,staff_id,payment_id,customer_id,amount
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Wayne,612.0,1.0,4321.0,2005-07-07 17:52:38,2005-07-11 23:37:38,1.0,30006.0,91.0,4.99
1,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Wayne,612.0,1.0,10137.0,2005-07-31 22:01:41,2005-08-07 22:24:41,1.0,31589.0,236.0,4.99
2,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Wayne,612.0,1.0,14741.0,2006-02-14 15:16:03,NaT,2.0,32034.0,60.0,0.00
3,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Wayne,613.0,1.0,9481.0,2005-07-30 23:26:05,2005-08-04 17:46:05,1.0,27576.0,481.0,4.99
4,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Wayne,613.0,1.0,11710.0,2005-08-17 07:29:44,2005-08-19 02:06:44,2.0,22214.0,553.0,4.99
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88265,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Monroe,4581.0,2.0,711.0,2005-05-29 03:49:03,2005-05-31 08:29:03,2.0,NaN,NaN,NaN
88266,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Monroe,4581.0,2.0,1493.0,2005-06-15 21:50:32,2005-06-17 01:02:32,2.0,19381.0,235.0,4.99
88267,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Monroe,4581.0,2.0,6712.0,2005-07-12 13:24:47,2005-07-20 09:35:47,2.0,31454.0,226.0,9.99
88268,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Monroe,4581.0,2.0,9701.0,2005-07-31 07:32:21,2005-08-01 05:07:21,2.0,26689.0,401.0,4.99
88269,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Monroe,4581.0,2.0,12894.0,2005-08-19 03:49:28,2005-08-25 01:51:28,2.0,22110.0,541.0,7.99

In [15]:
#2 master
#merging several dataframes into master1 dataframe 
df11 = pd.merge(filmdf, film_categorydf, how='left', on='film_id')
df12 = pd.merge(df11, categorydf, how='left', on='category_id')
df13 = pd.merge(df12, inventorydf, how='left', on='film_id')
df14 = pd.merge(df13, rentaldf, how='left', on='inventory_id')
#dropping duplicate columns
paymentdf = paymentdf.drop(columns = 'staff_id')
m2 = pd.merge(df14, paymentdf, how='left', on='rental_id')
paymentdf = pd.DataFrame(data=paymentdata, columns=paymentcolumns)
#reseting paymentdf
paymentdf = paymentdf.drop(columns='payment_date')
m2

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,name,inventory_id,store_id,rental_id,rental_date,return_date,staff_id,payment_id,customer_id,amount
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Music,612.0,1.0,4321.0,2005-07-07 17:52:38,2005-07-11 23:37:38,1.0,30006.0,91.0,4.99
1,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Music,612.0,1.0,10137.0,2005-07-31 22:01:41,2005-08-07 22:24:41,1.0,31589.0,236.0,4.99
2,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Music,612.0,1.0,14741.0,2006-02-14 15:16:03,NaT,2.0,32034.0,60.0,0.00
3,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Music,613.0,1.0,9481.0,2005-07-30 23:26:05,2005-08-04 17:46:05,1.0,27576.0,481.0,4.99
4,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,Music,613.0,1.0,11710.0,2005-08-17 07:29:44,2005-08-19 02:06:44,2.0,22214.0,553.0,4.99
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16086,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Comedy,4581.0,2.0,711.0,2005-05-29 03:49:03,2005-05-31 08:29:03,2.0,NaN,NaN,NaN
16087,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Comedy,4581.0,2.0,1493.0,2005-06-15 21:50:32,2005-06-17 01:02:32,2.0,19381.0,235.0,4.99
16088,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Comedy,4581.0,2.0,6712.0,2005-07-12 13:24:47,2005-07-20 09:35:47,2.0,31454.0,226.0,9.99
16089,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Comedy,4581.0,2.0,9701.0,2005-07-31 07:32:21,2005-08-01 05:07:21,2.0,26689.0,401.0,4.99
16090,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,Comedy,4581.0,2.0,12894.0,2005-08-19 03:49:28,2005-08-25 01:51:28,2.0,22110.0,541.0,7.99

In [16]:
#3 & 4 master
# #merging several dataframes into master1 dataframe 
df21 = pd.merge(filmdf, inventorydf, how='left', on='film_id')
df22 = pd.merge(df21, rentaldf, how='left', on='inventory_id')
#dropping duplicate columns
paymentdf = paymentdf.drop(columns = 'staff_id')
df23 = pd.merge(df22, paymentdf, how='left', on='rental_id')
staffdf = staffdf.drop(columns='store_id')
df24 = pd.merge(df23, staffdf, how='left', on='staff_id')
m3_4 = pd.merge(df24, storedf, how='left', on='store_id')
m3_4

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,amount,first_name,last_name,address_id,email,active,username,password,picture,manager_staff_id
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,4.99,Mike,Hillyer,3.0,Mike.Hillyer@sakilastaff.com,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,"[b'\x89', b'P', b'N', b'G', b'\r', b'\n', b'Z'...",1.0
1,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,4.99,Mike,Hillyer,3.0,Mike.Hillyer@sakilastaff.com,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,"[b'\x89', b'P', b'N', b'G', b'\r', b'\n', b'Z'...",1.0
2,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,0.00,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,None,1.0
3,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,4.99,Mike,Hillyer,3.0,Mike.Hillyer@sakilastaff.com,True,Mike,8cb2237d0679ca88db6464eac60da96345513964,"[b'\x89', b'P', b'N', b'G', b'\r', b'\n', b'Z'...",1.0
4,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,4.99,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,None,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16086,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,NaN,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,None,2.0
16087,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,4.99,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,None,2.0
16088,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,9.99,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,None,2.0
16089,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,4.99,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,None,2.0
16090,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,7.99,Jon,Stephens,4.0,Jon.Stephens@sakilastaff.com,True,Jon,8cb2237d0679ca88db6464eac60da96345513964,None,2.0

In [17]:
m1['actor_name'] = m1.first_name + " " + m1.last_name
m1 = m1.drop(columns = ['first_name', 'last_name'])
#actor name concat
m1

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,...,inventory_id,store_id,rental_id,rental_date,return_date,staff_id,payment_id,customer_id,amount,actor_name
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,612.0,1.0,4321.0,2005-07-07 17:52:38,2005-07-11 23:37:38,1.0,30006.0,91.0,4.99,Alec Wayne
1,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,612.0,1.0,10137.0,2005-07-31 22:01:41,2005-08-07 22:24:41,1.0,31589.0,236.0,4.99,Alec Wayne
2,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,612.0,1.0,14741.0,2006-02-14 15:16:03,NaT,2.0,32034.0,60.0,0.00,Alec Wayne
3,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,613.0,1.0,9481.0,2005-07-30 23:26:05,2005-08-04 17:46:05,1.0,27576.0,481.0,4.99,Alec Wayne
4,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,...,613.0,1.0,11710.0,2005-08-17 07:29:44,2005-08-19 02:06:44,2.0,22214.0,553.0,4.99,Alec Wayne
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88265,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,4581.0,2.0,711.0,2005-05-29 03:49:03,2005-05-31 08:29:03,2.0,NaN,NaN,NaN,Lisa Monroe
88266,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,4581.0,2.0,1493.0,2005-06-15 21:50:32,2005-06-17 01:02:32,2.0,19381.0,235.0,4.99,Lisa Monroe
88267,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,4581.0,2.0,6712.0,2005-07-12 13:24:47,2005-07-20 09:35:47,2.0,31454.0,226.0,9.99,Lisa Monroe
88268,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,4581.0,2.0,9701.0,2005-07-31 07:32:21,2005-08-01 05:07:21,2.0,26689.0,401.0,4.99,Lisa Monroe
88269,1000,Zorro Ark,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,...,4581.0,2.0,12894.0,2005-08-19 03:49:28,2005-08-25 01:51:28,2.0,22110.0,541.0,7.99,Lisa Monroe

In [18]:
#1.Top 5 most profitable actors
master1 = m1.copy()
master1 = master1.drop(columns = ['description','release_year','language_id','rental_duration','rental_rate','length','replacement_cost','rating'])
master1 = master1.drop(columns = ['special_features','fulltext','inventory_id','store_id','rental_id','rental_date','return_date','staff_id'])
#copy and drop redundant columns
master1 = master1.dropna(axis=0)
#drop nan rows
m1s1 = master1.groupby('actor_name')['customer_id'].size()
m1s2 = master1.groupby('actor_name')['amount'].sum()
#grouping data 
m1s3 = pd.Series(data = (m1s2.values/m1s1.values), index=m1s1.index)
#dividing grouped data to get avg values
m1s4d = list()
for i in m1s3.values:
    m1s4d.append(round(i,4))
#rounding averages
m1s4 = pd.Series(data = m1s4d, index=m1s1.index)
d1f = {
    'actor' : m1s1.index,
    'amount($)' : m1s2.values,
    'number_of_customers' : m1s1.values,
    'average_amount_per_customer($)' : m1s4.values
}
#columnname-data pairs
master1f = pd.DataFrame(data=d1f)
#creating final master1
master1f = master1f.sort_values('amount($)',ascending=False)
#final df and sort by amount
master1f

,actor,amount($),number_of_customers,average_amount_per_customer($)
180,Susan Davis,3193.49,750,4.2580
65,Gina Degeneres,3129.17,685,4.5681
125,Matthew Carrey,2543.78,619,4.1095
123,Mary Keitel,2426.92,607,3.9982
173,Scarlett Damon,2403.81,519,4.6316
...,...,...,...,...
171,Sandra Peck,952.36,263,3.6211
99,Judy Dean,904.70,232,3.8996
0,Adam Grant,869.46,254,3.4231
177,Sissy Sobieski,830.84,216,3.8465
51,Emily Dee,812.04,197,4.1220

In [19]:
#2.Top 5 most profitable categories
master2 = m2.copy()
master2 = master2.drop(columns = ['description','release_year','language_id','rental_duration','rental_rate','length','replacement_cost','rating',])
master2 = master2.drop(columns = ['special_features','fulltext','inventory_id','store_id','rental_id','rental_date','return_date','staff_id'])
master2 = master2.dropna(axis=0)
#dropna and redundant columns
m2s1 = master2.groupby('name')['customer_id'].size()
m2s2 = master2.groupby('name')['amount'].sum()
#grouping data 
m2s3d = list()
for i in range(len(m2s1.values)):
    m2s3d.append(round((m2s2.values[i]/m2s1.values[i]),4))
#dividing grouped data to get avg values
m2s3 = pd.Series(data=m2s3d, index=m2s1.index)
d2f = {
    'category' : m2s2.index,
    'amount($)' : m2s2.values,    
    'number_of_customers' : m2s1.values,
    'average_amount_per_customer($)' : m2s3.values
}
#columnname-data pairs
master2f = pd.DataFrame(data=d2f)
#creating final master2 
master2f = master2f.sort_values('amount($)',ascending=False)
#final df and sort by amount
master2f

       category amount($)  number_of_customers average_amount_per_customer($)
14       Sports   4892.19                 1081                         4.5256
13       Sci-Fi   4336.01                  998                         4.3447
1     Animation   4245.31                 1065                         3.9862
6         Drama   4118.46                  953                         4.3216
4        Comedy   4002.48                  851                         4.7033
12          New   3966.38                  864                         4.5907
0        Action   3951.84                 1013                         3.9011
8       Foreign   3934.47                  953                         4.1285
9         Games   3922.18                  884                         4.4369
7        Family   3830.15                  988                         3.8767
5   Documentary   3749.65                  937                         4.0018
10       Horror   3401.27                  773                         4.4001
3      Classics   3353.38                  860                         3.8993
2      Children   3309.39                  861                         3.8437
15       Travel   3227.36                  765                         4.2188
11        Music   3071.52                  750                         4.0954

In [20]:
m3_4['employee_name'] = m3_4.first_name + ' ' + m3_4.last_name 
m3_4 = m3_4.drop(columns=['first_name','last_name'])
#concat employee name and lastname

In [21]:
#3.Top 5 most profitable employees
master3 = m3_4.copy()
master3 = master3.drop(columns=['manager_staff_id','picture','password','username','email','address_id','rating'])
master3 = master3.drop(columns=['description','title','release_year','language_id','rental_duration','rental_rate','length','replacement_cost'])
master3 = master3.drop(columns=['special_features','fulltext','inventory_id','store_id','rental_id','rental_date','return_date'])
master3 = master3.dropna(axis=0)
#dropping redundant columns and rows
m3s1 = master3.groupby('employee_name')['amount'].sum()
m3s2 = master3.groupby('employee_name')['customer_id'].size()
#grouping data 
m3s3d = list()
for i in range(len(m3s1.index)):
    m3s3d.append(round((m3s1.values[i]/m3s2.values[i]),4))
m3s3 = pd.Series(data=m3s3d)
#dividing grouped data to get avg values
d3f = {
    'employee' : m3s1.index,
    'amount_of_earnings($)' : m3s1.values,
    'number_of_customers_served' : m3s2.values,
    'average_amount_per_customer($)' : m3s3.values
}
#columnname-data pairs
master3f = pd.DataFrame(data=d3f)
#creating final master3
master3f = master3f.sort_values('amount_of_earnings($)',ascending=False)
#final df and sort by amount
master3f

,employee,amount_of_earnings($),number_of_customers_served,average_amount_per_customer($)
0,Jon Stephens,30813.33,7265,4.2413
1,Mike Hillyer,30498.71,7331,4.1602

In [22]:
#4.Top 5 most profitable stores
master4 = m3_4.copy()
master4 = master4.drop(columns=['manager_staff_id','picture','password','username','email','address_id','rating'])
master4 = master4.drop(columns=['description','title','release_year','language_id','rental_duration','rental_rate','length','replacement_cost'])
master4 = master4.drop(columns=['special_features','fulltext','inventory_id','staff_id','rental_id','rental_date','return_date'])
master4 = master4.dropna(axis=0)
#dropping redundant columns and rows
m4s1 = master4.groupby('store_id')['amount'].sum()
m4s2 = master4.groupby('store_id')['customer_id'].size()
#grouping data 
m4s3d = list()
for i in range(len(m4s1.index)):
    m4s3d.append(round((m4s1.values[i]/m4s2.values[i]),4))
#rounding averages
m4s3 = pd.Series(data=m4s3d)
#grouping df data
d4f = {
    'store_id' : m4s1.index,
    'amount_of_earnings($)' : m4s1.values,
    'number_of_customers_served' : m4s2.values,
    'average_amount_per_customer($)' : m4s3.values
}
#columnname-data pairs
master4f = pd.DataFrame(data=d4f)
#creating final master4
master4f = master4f.sort_values('amount_of_earnings($)',ascending=False)
#final df and sort by amount
master4f

,store_id,amount_of_earnings($),number_of_customers_served,average_amount_per_customer($)
1,2.0,30683.13,7385,4.1548
0,1.0,30628.91,7211,4.2475

In [23]:
#same process for master1, only using sql queries for data grouping and table merges
cur.execute("""SELECT film.film_id,title,film_actor.actor_id,CONCAT(actor.first_name,' ',actor.last_name),payment.customer_id,payment.rental_id,amount
FROM film
LEFT JOIN film_actor
ON film_actor.film_id = film.film_id
LEFT JOIN actor
ON actor.actor_id = film_actor.actor_id
LEFT JOIN inventory
ON inventory.film_id = film.film_id
LEFT JOIN rental
ON rental.inventory_id = inventory.inventory_id
LEFT JOIN payment
ON payment.rental_id = rental.rental_id""")
#assembling column names and df data
master1sqldata = cur.fetchall()
master1sqlcol = ['film_id','title','actor_id','actor_name','customer_id','rental_id','amount']
#creating df
master1fsql = pd.DataFrame(data=master1sqldata,columns=master1sqlcol)
#dropping rows with NaN values
master1fsql = master1fsql.dropna(axis=0)
master1fsql

,film_id,title,actor_id,actor_name,customer_id,rental_id,amount
0,749,Rules Human,161.0,Harvey Hope,341.0,1520.0,7.99
1,749,Rules Human,127.0,Kevin Garland,341.0,1520.0,7.99
2,749,Rules Human,77.0,Cary Mcconaughey,341.0,1520.0,7.99
3,749,Rules Human,59.0,Dustin Tautou,341.0,1520.0,7.99
4,749,Rules Human,1.0,Penelope Guiness,341.0,1520.0,7.99
...,...,...,...,...,...,...,...
80148,326,Flying Hook,130.0,Greta Keitel,264.0,14243.0,2.99
80149,326,Flying Hook,128.0,Cate Mcqueen,264.0,14243.0,2.99
80150,326,Flying Hook,102.0,Walter Torn,264.0,14243.0,2.99
80151,326,Flying Hook,40.0,Johnny Cage,264.0,14243.0,2.99
80152,326,Flying Hook,15.0,Cuba Olivier,264.0,14243.0,2.99

In [24]:
#same process for master2, only using sql queries for data grouping and table merges
cur.execute("""SELECT film.film_id,title,category.category_id,category.name,rental.customer_id,payment.payment_id,amount
FROM film
LEFT JOIN film_category
ON film_category.film_id = film.film_id
LEFT JOIN category
ON category.category_id = film_category.category_id
LEFT JOIN inventory
ON inventory.film_id = film.film_id
LEFT JOIN rental
ON rental.inventory_id = inventory.inventory_id
LEFT JOIN payment
ON payment.rental_id = rental.rental_id
""")
#assembling column names and df data
master2sqldata = cur.fetchall()
master2sqlcol = ['film_id','title','category_id','category','customer_id','payment_id','amount']
#creating df
master2sql = pd.DataFrame(data=master2sqldata,columns=master2sqlcol)
#dropping rows with NaN values
master2sql = master2sql.dropna(axis=0)
master2sql

,film_id,title,category_id,category,customer_id,payment_id,amount
0,749,Rules Human,11,Horror,341.0,17503.0,7.99
1,552,Majestic Floats,6,Documentary,341.0,17504.0,1.99
2,551,Maiden Home,13,New,341.0,17505.0,7.99
3,445,Hyde Doctor,4,Classics,341.0,17506.0,2.99
4,563,Massacre Usual,10,Games,341.0,17507.0,7.99
...,...,...,...,...,...,...,...
14591,254,Driver Annie,15,Sports,245.0,32094.0,2.99
14592,870,Swarm Gold,11,Horror,251.0,32095.0,0.99
14593,253,Drifter Commandments,1,Action,252.0,32096.0,4.99
14594,270,Earth Vision,13,New,263.0,32097.0,0.99
14595,326,Flying Hook,2,Animation,264.0,32098.0,2.99

In [25]:
#same process for master3, only using sql queries for data grouping and table merges
cur.execute("""SELECT film.film_id,title,staff.staff_id,active,CONCAT(staff.first_name,' ',staff.last_name),rental.customer_id,amount
FROM film
LEFT JOIN inventory
ON inventory.film_id = film.film_id
LEFT JOIN rental
ON rental.inventory_id = inventory.inventory_id
LEFT JOIN payment
ON payment.rental_id = rental.rental_id
LEFT JOIN staff
ON staff.staff_id = payment.staff_id
LEFT JOIN store
ON store.store_id = staff.store_id""")
#assembling column names and df data
master3sqldata = cur.fetchall()
master3sqlcol = ['film_id','title','staff_id','active','employee_name','customer_id','amount']
#creating df
master3sql = pd.DataFrame(data=master3sqldata, columns=master3sqlcol)
#dropping rows with NaN values
master3sql = master3sql.dropna(axis=0)
master3sql

,film_id,title,staff_id,active,employee_name,customer_id,amount
0,749,Rules Human,2.0,True,Jon Stephens,341.0,7.99
1,552,Majestic Floats,1.0,True,Mike Hillyer,341.0,1.99
2,551,Maiden Home,1.0,True,Mike Hillyer,341.0,7.99
3,445,Hyde Doctor,2.0,True,Jon Stephens,341.0,2.99
4,563,Massacre Usual,2.0,True,Jon Stephens,341.0,7.99
...,...,...,...,...,...,...,...
14591,254,Driver Annie,2.0,True,Jon Stephens,245.0,2.99
14592,870,Swarm Gold,1.0,True,Mike Hillyer,251.0,0.99
14593,253,Drifter Commandments,2.0,True,Jon Stephens,252.0,4.99
14594,270,Earth Vision,1.0,True,Mike Hillyer,263.0,0.99
14595,326,Flying Hook,2.0,True,Jon Stephens,264.0,2.99

In [26]:
#same process for master4, only using sql queries for data grouping and table merges
cur.execute("""SELECT film.film_id,title,store.store_id,address.address,rental.customer_id,amount
FROM film
LEFT JOIN inventory
ON inventory.film_id = film.film_id
LEFT JOIN rental
ON rental.inventory_id = inventory.inventory_id
LEFT JOIN payment
ON payment.rental_id = rental.rental_id
LEFT JOIN staff
ON staff.staff_id = payment.staff_id
LEFT JOIN store
ON store.store_id = staff.store_id
LEFT JOIN address 
ON address.address_id = store.address_id""")
#assembling column names and df data
master4sqldata = cur.fetchall()
master4sqlcol = ['film_id','title','store_id','address','customer_id','amount']
#creating df
master4sql = pd.DataFrame(data=master4sqldata, columns=master4sqlcol)
#dropping rows with NaN values
master4sql = master4sql.dropna(axis=0)
master4sql

,film_id,title,store_id,address,customer_id,amount
0,749,Rules Human,2.0,28 MySQL Boulevard,341.0,7.99
1,552,Majestic Floats,1.0,47 MySakila Drive,341.0,1.99
2,551,Maiden Home,1.0,47 MySakila Drive,341.0,7.99
3,445,Hyde Doctor,2.0,28 MySQL Boulevard,341.0,2.99
4,563,Massacre Usual,2.0,28 MySQL Boulevard,341.0,7.99
...,...,...,...,...,...,...
14591,254,Driver Annie,2.0,28 MySQL Boulevard,245.0,2.99
14592,870,Swarm Gold,1.0,47 MySakila Drive,251.0,0.99
14593,253,Drifter Commandments,2.0,28 MySQL Boulevard,252.0,4.99
14594,270,Earth Vision,1.0,47 MySakila Drive,263.0,0.99
14595,326,Flying Hook,2.0,28 MySQL Boulevard,264.0,2.99

In [27]:
#same process for master1f, only using sql queries for data grouping and table merges
cur.execute("""SELECT CONCAT(actor.first_name,' ',actor.last_name),count(payment.customer_id),sum(amount),(sum(amount)/count(payment.customer_id))
FROM film
LEFT JOIN film_actor
ON film_actor.film_id = film.film_id
LEFT JOIN actor
ON actor.actor_id = film_actor.actor_id
LEFT JOIN inventory
ON inventory.film_id = film.film_id
LEFT JOIN rental
ON rental.inventory_id = inventory.inventory_id
LEFT JOIN payment
ON payment.rental_id = rental.rental_id
GROUP BY concat
ORDER BY sum DESC
""")
#assembling column names and df data
master1fsqldata = cur.fetchmany(200)
master1fsqlcol = ['actor_name','count_of_rentals_per_actor','total_movie_earnings_per_actor','avg_amount_of_payments_per_count']
#creating df
master1fsql = pd.DataFrame(data=master1fsqldata,columns=master1fsqlcol)
master1fsql

,actor_name,count_of_rentals_per_actor,total_movie_earnings_per_actor,avg_amount_of_payments_per_count
0,Susan Davis,750,3193.49,4.2579866666666667
1,Gina Degeneres,685,3129.17,4.5681313868613139
2,Matthew Carrey,619,2543.78,4.1094991922455574
3,Mary Keitel,607,2426.92,3.9982207578253707
4,Scarlett Damon,519,2403.81,4.6316184971098266
...,...,...,...,...
195,Judy Dean,232,904.70,3.8995689655172414
196,Adam Grant,254,869.46,3.4230708661417323
197,Sissy Sobieski,216,830.84,3.8464814814814815
198,Emily Dee,197,812.04,4.1220304568527919
199,,38,192.62,5.0689473684210526

In [28]:
#same process for master2f, only using sql queries for data grouping and table merges
cur.execute("""SELECT category.name,count(payment.customer_id),sum(amount),(sum(amount)/count(payment.customer_id))
FROM film
LEFT JOIN film_category
ON film_category.film_id = film.film_id
LEFT JOIN category
ON category.category_id = film_category.category_id
LEFT JOIN inventory
ON inventory.film_id = film.film_id
LEFT JOIN rental
ON rental.inventory_id = inventory.inventory_id
LEFT JOIN payment
ON payment.rental_id = rental.rental_id
GROUP BY category.name
ORDER BY sum DESC
""")
#assembling column names and df data
master2fsqldata = cur.fetchall()
master2fsqlcol = ['category_name','number_of_movie_buyers_per_category','total_movie_earnings_per_category','avg_payment_amount_per_buyer']
#creating df
master2fsql = pd.DataFrame(data=master2fsqldata,columns=master2fsqlcol)
master2fsql

,category_name,number_of_movie_buyers_per_category,total_movie_earnings_per_category,avg_payment_amount_per_buyer
0,Sports,1081,4892.19,4.5256151711378353
1,Sci-Fi,998,4336.01,4.3446993987975952
2,Animation,1065,4245.31,3.9862065727699531
3,Drama,953,4118.46,4.3215739769150052
4,Comedy,851,4002.48,4.7032667450058754
5,New,864,3966.38,4.5907175925925926
6,Action,1013,3951.84,3.9011253701875617
7,Foreign,953,3934.47,4.1285099685204617
8,Games,884,3922.18,4.4368552036199095
9,Family,988,3830.15,3.8766700404858300
10,Documentary,937,3749.65,4.0017609391675560
11,Horror,773,3401.27,4.4000905562742561
12,Classics,860,3353.38,3.8992790697674419
13,Children,861,3309.39,3.8436585365853659
14,Travel,765,3227.36,4.2187712418300654
15,Music,750,3071.52,4.0953600000000000

In [29]:
#same process for master3f, only using sql queries for data grouping and table merges
cur.execute("""SELECT CONCAT(staff.first_name,' ',staff.last_name),count(payment.customer_id),sum(amount),(sum(amount)/count(payment.customer_id))
FROM film
LEFT JOIN inventory
ON inventory.film_id = film.film_id
LEFT JOIN rental
ON rental.inventory_id = inventory.inventory_id
LEFT JOIN payment
ON payment.rental_id = rental.rental_id
LEFT JOIN staff
ON staff.staff_id = payment.staff_id
LEFT JOIN store
ON store.store_id = staff.store_id
GROUP BY concat 
ORDER BY sum DESC
""")
#assembling column names and df data
master3fsqldata = cur.fetchmany(200)
master3fsqlcol = ['employee_name','number_of_served_customers','total_earnings','avg_payment_per_customer']
#creating df
master3fsql = pd.DataFrame(data=master3fsqldata, columns=master3fsqlcol)
#dropping rows with NaN values
master3fsql = master3fsql.dropna(axis=0)
master3fsql

,employee_name,number_of_served_customers,total_earnings,avg_payment_per_customer
1,Jon Stephens,7304,31059.92,4.2524534501642935
2,Mike Hillyer,7292,30252.12,4.1486725178277564

In [30]:
master3f
#comparison

,employee,amount_of_earnings($),number_of_customers_served,average_amount_per_customer($)
0,Jon Stephens,30813.33,7265,4.2413
1,Mike Hillyer,30498.71,7331,4.1602

In [31]:
#same process for master4f, only using sql queries for data grouping and table merges
cur.execute("""SELECT address.address,count(payment.customer_id),sum(amount),(sum(amount)/count(payment.customer_id))
FROM film
LEFT JOIN inventory
ON inventory.film_id = film.film_id
LEFT JOIN rental
ON rental.inventory_id = inventory.inventory_id
LEFT JOIN payment
ON payment.rental_id = rental.rental_id
LEFT JOIN staff
ON staff.staff_id = payment.staff_id
LEFT JOIN store
ON store.store_id = staff.store_id
LEFT JOIN address 
ON address.address_id = store.address_id
GROUP BY address.address
ORDER BY sum DESC""")
#assembling column names and df data
master4fsqldata = cur.fetchmany(200)
master4fsqlcol = ['store_address','number_of_paid_customers','store_earnings','avg_amount_paid_by_customer']
#creating df
master4fsql = pd.DataFrame(data=master4fsqldata, columns=master4fsqlcol)
#dropping rows with NaN values
master4fsql = master4fsql.dropna(axis=0)
master4fsql

,store_address,number_of_paid_customers,store_earnings,avg_amount_paid_by_customer
1,28 MySQL Boulevard,7304,31059.92,4.2524534501642935
2,47 MySakila Drive,7292,30252.12,4.1486725178277564

In [32]:
master4f
#comparison

,store_id,amount_of_earnings($),number_of_customers_served,average_amount_per_customer($)
1,2.0,30683.13,7385,4.1548
0,1.0,30628.91,7211,4.2475

In [33]:
#5. Top 5 monthly profit per customer
#sql queries for merges and grouping - by sum of profits
cur.execute("""SELECT CONCAT(customer.first_name,' ',customer.last_name),EXTRACT(MONTH FROM payment.payment_date) AS month, sum(amount)
FROM payment
LEFT JOIN rental
ON rental.rental_id = payment.rental_id
LEFT JOIN customer
ON customer.customer_id = rental.customer_id
WHERE return_date IS NOT NULL 
GROUP BY concat,month
ORDER BY sum DESC
""")
master5fsqldata = cur.fetchall()
master5fsqlcol = ['customer_name','month','total_profit_per_month($)']
#column names and data
master5fsql = pd.DataFrame(data=master5fsqldata,columns=master5fsqlcol)
#creating df
mndata = ['Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec']
mnthvalues = list()
for i in master5fsql.month.values:
    i = mndata[int(i)-1]
    mnthvalues.append(i)
master5fsql.month = mnthvalues
#replacing month indices with month names
master5fsql

          customer_name month total_profit_per_month($)
0          Eleanor Hunt   Apr                    100.78
1         Arnold Havens   Apr                     97.81
2         Gordon Allard   Apr                     96.83
3        Rhonda Kennedy   Apr                     96.81
4            Clara Shaw   Apr                     93.82
...                 ...   ...                       ...
1711         Fred Wheat   Feb                      0.99
1712   Charlene Alvarez   Feb                      0.99
1713        Leon Bostic   Feb                      0.99
1714  Ashley Richardson   Feb                      0.99
1715       Elsie Kelley   Feb                      0.99

[1716 rows x 3 columns]